IDEA Open Model
RebarPatternBase.Relative Property
Compatible with IDEA StatiCa 20.1
 Mode of defining the position of the pattern false is for absolute length (position) of the pattern (default) true is for relative length (position) of the pattern in range [0 1]
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public bool Relative { get; set; }
Public Property Relative As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebarPatternBase Class
IdeaRS.OpenModel.Model Namespace